bryamzxz/tinylink/sdkconfig.defaults
# ---- mbedTLS — drop X.509 CRL + CSR parsers (unused by tinylink) ------------
# CRL_PARSE_C: Certificate Revocation List parser. mbedTLS's
# x509_crt_verifycrl is the only consumer in the verify path, and
# esp_tls invokes mbedtls_x509_crt_verify_with_profile passing NULL for
# `ca_crl` (esp-tls/esp_tls_mbedtls.c: no CRL argument is constructed
# anywhere). controlplane.tailscale.com publishes OCSP responses, not
# CRLs — Let's Encrypt deprecated CRL distribution points for end-entity
# certs years ago and runs OCSP via ocsp.int-x3.letsencrypt.org. We
# don't do OCSP stapling either; revocation checking on this device is
# best-effort via fresh handshakes and the rotation cadence the cert
# bundle ships with. The verify path stays correct: untrusted leaf
# certs are still rejected via signature + chain + expiry checks,
# only the "is this cert on a revocation list" probe goes away —
# which was a no-op already.
#
# CSR_PARSE_C: Certificate Signing Request parser. Tinylink never
# generates or parses CSRs — `keys.c`, `control_key.c`, and
# `noise_ik.c` produce raw key material (Curve25519 + ECDSA-P256)
# without an enrolment / X509 path. esp_tls doesn't parse CSRs either
# (it's a client TLS lib, not a CA). Pure dead code.
#
# Symbol impact (pre-trim ELF via xtensa-esp32-elf-nm): x509_crt_verifycrl
# (233 B static helper) + x509_get_crl_extensions / x509_get_crl_entry_ext
# / mbedtls_x509_crl_* full parser. mbedtls_x509_csr_parse* parser
# already gc-section-stripped by the linker (no caller). Verify-path
# integration #ifdef'd via MBEDTLS_X509_CRL_PARSE_C in
# mbedtls/library/x509_crt.c.
# CONFIG_MBEDTLS_X509_CRL_PARSE_C is not set
# CONFIG_MBEDTLS_X509_CSR_PARSE_C is not set

# ---- mbedTLS — drop static-ECDH key exchanges (TLS_ECDH_* suites) -----------
# ECDH_ECDSA / ECDH_RSA are static-ECDH cipher suites where the server's
# long-term ECDH public key sits in its cert (RFC 4492 §2.1, §2.3). They
# pre-date forward-secret handshakes; Go's crypto/tls server (which
# controlplane.tailscale.com and the DERP fleet run) never advertises
# them — the supported list is constrained to TLS_ECDHE_* (ephemeral)
# + TLS_RSA_* fallback (see go/src/crypto/tls/cipher_suites.go).
#
# Verified empirically against the Stage-1 build (post curves trim):
# the handshake on this branch's parent picks ECDHE-RSA-AES128-GCM-
# SHA256 every time. Dropping static-ECDH does not narrow our viable
# suite set — those suites were dead negotiation surface only.
#
# ECDHE_RSA + ECDHE_ECDSA stay on (those are what Tailscale actually
# negotiates). RSA stays on too as the TLS 1.2 fallback for the rare
# case an upstream proxy strips ECDHE preferences from the ClientHello.
#
# Symbol impact (xtensa-esp32-elf-nm, pre-trim ELF): `ssl_pick_cert`
# (124 B) does static-ECDH cert-key-type selection only; ssl_parse_*
# branches that handle the static-ECDH server-cert-as-keystore path;
# the static-ECDH entries in the cipher suite table. Shared mbedtls_
# ecdh_* helpers stay (also used by ECDHE).
# CONFIG_MBEDTLS_KEY_EXCHANGE_ECDH_ECDSA is not set
# CONFIG_MBEDTLS_KEY_EXCHANGE_ECDH_RSA is not set

# ---- lwIP tunings ------------------------------------------------------------
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=n
CONFIG_LWIP_TCP_SACK_OUT=n
CONFIG_LWIP_TCP_MSS=1440
# IPv4-only build: every socket in the firmware (WG UDP, esp_tls to
# controlplane.tailscale.com, DERP, STUN, telemetry) uses AF_INET. Disabling
# IPv6 recovers ~7 KiB RAM + ~39 KiB flash and shrinks the dual-stack
# attack surface.
CONFIG_LWIP_IPV6=n
# WireGuard sets its tunnel MTU to fit inside the outer UDP without IP
# fragmentation, and nothing on the outer side needs frag/reassembly.
# Reassembly is already off by IDF default; we pin both explicitly so
# regressions are caught at config-time. Removes a classic teardrop /
# overlap DoS surface on inbound packets. Safe because all outbound
# paths (WG UDP, TLS) fit under the link MTU.
CONFIG_LWIP_IP4_FRAG=n
CONFIG_LWIP_IP4_REASSEMBLY=n

# PPP support disabled — the WG tunnel netif now uses a custom no-op
# netstack defined in wg_lwip.c::s_wg_netstack_config (lines 178-184),
# landed in commit 4a915df ("feat/wg-netif-without-is-ppp"). Pre-Build-C
# we needed ESP_NETIF_NETSTACK_DEFAULT_PPP as the base template (forcing
# CONFIG_LWIP_PPP_SUPPORT=y), but the custom netstack now provides the
# raw-IP init_fn + stub input_fn directly without depending on the PPP
# module. Turning PPP off recovers ~10-20 KiB flash (ipcp_nakci,
# vj_compress_tcp, ppp_pcb, LCP/PAP/CHAP FSM, HDLC framing — all
# verified inalcanzables in the post-4a915df build via xtensa-esp32-elf-nm).
# CONFIG_LWIP_PPP_SUPPORT is not set

# ---- VFS trim ----------------------------------------------------------------
# Tinylink doesn't open files (no SD/SPIFFS/FAT), doesn't iterate
# directories (no readdir/opendir), and doesn't talk to the console
# beyond raw `printf` via UART. Keeping SELECT on because lwIP's user
# code may call select() on sockets; keeping IO on because newlib stdout
# routes through it.
# CONFIG_VFS_SUPPORT_TERMIOS is not set
# CONFIG_VFS_SUPPORT_DIR is not set

# ---- NVS encryption ----------------------------------------------------------
CONFIG_NVS_ENCRYPTION=y

# ---- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
# Production bootloader: no UART chatter (`ets Jul 29 2019…`, partition
# table dump, `boot:` lines, `esp_image:` segments). The bootloader
# still runs the same code; only the log prints are compiled out via
# Kconfig. Recovery on a stuck boot is still possible by re-flashing
# with a "diag" overlay that flips this back to INFO. Saves ~3 KiB in
# the bootloader binary slot (no impact on app slot).
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y

# ---- FreeRTOS ----------------------------------------------------------------
# HZ=100 (10 ms tick granularity) reduces tick-ISR overhead vs the IDF
# default 1000 (1 ms ticks) and lets tickless idle skip larger blocks
# at once. Audited 2026-05-10: every pdMS_TO_TICKS(N) callsite in tinylink
# uses N >= 100 ms, so no delay round-trips to 0 ticks. No bare integer
# tick arguments to vTaskDelay / xQueue* / xSemaphoreTake in our code.
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# ---- IRAM-to-flash placement (production trim) -------------------------------
# ESP32-WROOM-32E has only 128 KiB IRAM total; the post-η firmware was
# at 80% IRAM (104 KiB used, 27 KiB free). These three knobs move
# never-from-ISR code paths out of IRAM and into flash-XIP. Real-time
# behaviour is unchanged because none of these functions are reachable
# while flash is suspended (auto-suspend disabled in tinylink) or from
# cache-disabled ISRs (we have no such ISR). Documented cost: WiFi
# RX throughput drops a few percent because every RX packet now incurs
# a flash cache miss on its first call. Tinylink's load (1 Hz
# telemetry + ~6/min long-poll inbound + WG handshake every ~85 s) is
# 3 orders of magnitude below the WiFi ceiling, so the throughput
# hit is invisible.

